[
      {
            "date": "2021-03-12T06:07:30Z",
            "title": "Banking on digital opportunity amid COVID-19 pandemic",
            "full_article": "\n\nMetro Manila (CNN Philippines) — The need for movement restrictions due to the COVID-19 pandemic has accelerated a transition towards digital banking.\nMore Filipinos have turned to online fund transfers instead of ATM transactions when the enhanced community quarantine was imposed in March 2020. Bangko Sentral ng Pilipinas Governor Benjamin Diokno earlier reported a 25 percent increase in online bank transactions for the first one and a half months of the ECQ, compared to 45 days before strict stay-at-home rules took effect.\nRecognizing this shift in customer behavior, the BSP late last year approved a new set of rules for fully online banks or those that accept deposits and fund transfer requests – as legitimate entities even if they do not have brick-and-mortar branches.\nFollowing the release of the banking industry framework, a digital-only bank based in Singapore sought to launch in the Philippines.\nDigital bank UNObank is currently working with regulators to obtain its license to operate in the Philippines and is on a mission to help bring unbanked Filipinos into the formal banking system.\n“Financial inclusion is a big challenge in the Philippines,” UNObank founder Manish Bhai told CNN Philippines’ New Day on Friday.\n“Fifty million people are unbanked, so making banking available to the unbanked or bringing innovative products and solutions - which are simpler and more competitive to those who already have bank accounts - is a very exciting and eventful journey,” he added.\nHelping UNObank realize its goal is a global financial technology (fintech) company, Backbase, with their Asia Pacific hub in Singapore.\nProviding a “digital-first” engagement banking platform to financial institutions, Backbase’s digital-first strategy stems from a focus on the customer experience. This includes addressing the various issues and pain points throughout the customer banking journey to help banks create better digital customer experiences.\n“We believe that a one-single platform that we are bringing to the table should be able to do four things - delight customers of banks, empower the employees of banks, orchestrate a lot of value from an ecosystem perspective and finally, digitize these operations,” Riddhi Dutta, regional head for ASEAN and India at Backbase, said in an interview on New Day.\nRiddhi also shared that there are opportunities for incumbent banks to work together with fintech firms to leverage each other’s skillsets and niche. This allows banks to have better operation efficiency to stay much more agile while focusing on customer’s needs.\n“At the end of the day, we want to make a difference to the way people are banking and the way people are doing their financial transactions,” he added.\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
            "author": "Cnn Philippines"
      },
      {
            "date": "2021-03-11T12:14:28Z",
            "title": "Arthaland tops off its green office development in ARCA South",
            "full_article": "\n\nMetro Manila (CNN Philippines) — Arthaland Corporation is off to a strong start this 2021 as it tops off its Savya Financial Center North Tower in ARCA South, Taguig City.\nThe two-tower sustainable office project was launched in 2019, with its North Tower built in partnership with Mitsubishi Estate, one of Japan’s largest real estate developers. This tower is expected to be completed by November 2021.\n“Through this strong partnership, the Savya Financial Center became our company’s first venture in the Philippines,” said Masato Aikawa, managing director of Mitsubishi Estate Asia. “The success of this development will certainly become the foundation for our long-term partnership with Arthaland.”\n\n\n\n\n\n\n\n\n\nPHOTO FROM ARTHALAND. A fully integrated retail area will be located at the ground and second floor, which is envisioned to feature a mix of banking, dining, service, convenience, and lifestyle locators. (Artist’s Perspective)\n\n\n“Building on the success of our world-renowned and multi-awarded Arthaland Century Pacific Tower in Bonifacio Global City and the Cebu Exchange in Cebu City, Savya Financial Center is poised to become the preferred address in what will be the most highly connected business district in the country,” according to Jaime C. González, vice chairman and president of Arthaland.\nSavya will feature a fully integrated retail area, top-class amenities, zero-contact building features, retail area, and various green and open spaces.\nArthaland and Mitsubishi Estate are also incorporating new technologies into the tower, like remote virtual concierge and semi-autonomous security surveillance robots that promote a safer, healthier, contactless office environment. Occupants will also benefit from its sustainable and wellness features that create a better modern workplace ecosystem that encourages greater efficiency and productivity and provides higher operation savings, thus making it the ideal location for both local and multinational companies looking to thrive within this new global business environment.\n\n\n\n\n\n\n\n\n\nPHOTO FROM ARTHALAND. Interior-designed designer lobbies will feature zero contact technologies, such as virtual concierges, RFID turnstiles, among other features to create cleaner and healthier indoor environments. (Artist’s Perspective)\n\n\nStrategically located within ARCA South, an upcoming major growth center in Taguig City, Savya Financial Center will provide seamless access to Metro Manila and the global business community through various new transportation networks such as the Southeast Metro Manila Expressway, Metro Manila Skyway, Metro Manila Subway, and the Taguig Integrated Terminal Exchange.\nIt also lies near various warehousing facilities in the nearby Food Terminal, Inc., the Ninoy Aquino International Airport, and major business hubs like Makati City, Bonifacio Global City, and Ortigas Center.\nArthaland will also offer shuttle services to and from several pick-up and drop-off points across greater Metro Manila.\n\n\n\n\n\n\n\n\n\nPHOTO FROM ARTHALAND. A landscaped Sky Deck offers building occupant fantastic views and offers places for convergence in the midst of native and endemic vegetation. (Artist’s Perspective)\n\n\nSavya will soon become a multi-certified green building after it has been pre-certified for Leadership in Energy and Environmental Design (LEED) Gold certification. Meanwhile, it is on track to be granted Philippine Green Building Council’s Building for Ecologically Responsible Design Excellence (BERDE) certification, International WELL Building Institute’s WELL Building Standard™, and the International Finance Corporation’s Excellence in Design for Greater Efficiencies (EDGE®) certification.\n \n \nArthaland is the foremost green and sustainable developer recognized by both local and global organizations for its superior design, high quality, focus on sustainability and innovation. It has made its mark in the Philippine real estate industry by pioneering the development and management of exceptional best-in-class properties that adhere to international and local standards for premium green projects.\n \nThe Savya Financial Center showroom is located at the ARTHALAND GALLERY, G/F Arya Plaza at Arya Residences, McKinley Parkway corner Rizal Drive, Bonifacio Global City. For more information call +63917 77 ARTHA (27842), e-mail ask@arthaland.com, or visit www.arthaland.com.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
            "author": "Cnn Philippines"
      }
]